{
  "main": {
    "name": "Frantz Felix",
    "occupation": "Full Stack Developer",
    "description": "I currently have an interest in React, web secuirty, game development and all things tech!",
    "image": "profilepic.jpg",
    "bio": "I am a Front End Web Developer with a B.S. in Computer Science and a Minor in Animation. I recently earned a certificate in Full Stack Development from the University of Washington where I developed skills in JavaScript, CSS, React.js, and responsive web design. I am an innovative problem solver that is passionate about developing apps, with a focus on mobile-first design and development.",
    "bioPartTwo": "My degrees in Computer Science and Animation have given me a unique user focused approach to solving problems, where I focus on the aesthetic working as smoothly as the back-end. With each project, I aim to understand how to best engage users for an impactful user experience. I applied agile development in a recent project where I worked in a team of 4 to develop a single-page MERN app that helps local artists/producers find new talent, seek it out, and chat with one another.",
    "bioPartThree": "When I’m not designing or developing, I enjoy hiking, backpacking, and camping. I also enjoy indoor bouldering - I have only been doing it for a year but have gotten rather good at it! If I'm not being active, I’m hanging out with friends, 3D modeling, 3D printing, or playing video games!",
    "contactmessage": "You can reach me by filling out the form below",
    "email": "Frantz.C.Felix@gmail.com",
    "phone": "856-383-9440",
    "address": {
      "street": "",
      "city": "Seattle",
      "zip": "98122"
    },
    "website": "https://frantzcfelix.github.io/index.html",
    "resumedownload": "https://frantzcfelix.github.io/Resume/Frantz_Felix_Resume-02-2020.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/frantz-felix/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/FrantzCFelix",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "Rutgers University",
        "degree": "B.S. In Computer Science",
        "graduated": "May 2017",
        "description": "3.23 GPA | Minor in Animation | Dean's List Honoree Spring 2016"
      },
      {
        "school": "University of Washington",
        "degree": "Coding Bootcamp Certificate",
        "graduated": "May 2020",
        "description": "Achieved a thorough understanding of web development and became a proficient MERN Stack Developer. Worked with other aspiring developers in a collaborative environment to strengthen soft skills and complete projects that challenged my skill set. Full list of technologies and algorithms covered http://bit.ly/UWBC-FullStack"
      }
    ],
    "work": [
      {
        "company": "Trilogy Educations Services LLC",
        "title": "Teaching Assistant, Grader, Tutor",
        "years": "September 2020 - Present",
        "description": "I mentor and engage students in the classroom by working together with other instructors. Also I guide students to overcome technical hurdles in both their group projects and individual study."
      },
      {
        "company": "Trader Joe's",
        "title": "Crew Member",
        "years": "August 2019 - Present",
        "description": "On top of everyday customer service and stocking duties in a fun enviorment, I also am the order writer for a section of the store."
      },
      {
        "company": "CodeStreamStudios",
        "title": "Programmer",
        "years": "Jan 2019 - July 2019",
        "description": "Developed front end application components using Vue.JS framework, enhancing UI functionality. Implemented unit testing to existing code base and added new routines using Jest, improving first-time quality."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "JavaScript",
        "level": "55%"
      },
      {
        "name": "Nodejs/Express",
        "level": "48%"
      },
      {
        "name": "CSS",
        "level": "45%"
      },
      {
        "name": "HTML5",
        "level": "50%"
      },
      {
        "name": "React",
        "level": "45%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "RinqyDinqyArcade",
        "category": "A site that is supposed to serve as an indie portal for other game lovers(Mvp)",
        "image": "rinqydinky.png",
        "url": "https://rinqydinky.herokuapp.com/",
        "github": "https://github.com/FrantzCFelix/RINQYDINK",
        "description": "This is an app based on classic video game arcades from the 80s & early 90s. Kids used to come to play games, yes, but also to socialize and get human interaction. ",
        "tech": "Phaser 3, Socket.io, Passport.Js, MYSQL"
      },
      {
        "title": "Book-it-yourself",
        "category": "Connecting artist and promoters(Mvp)",
        "image": "book-it.png",
        "url": "https://book-it-yourself.herokuapp.com/#home",
        "github": "https://github.com/FrantzCFelix/book-it-yourself",
        "description": "Book-it-yourself is an app that connects artists and promoters across the globe. The inspiration for our project came from the 90's publication Book Your Own Fuc-in Life. This publication was instrumental in the 90's to help connect bands and promoters across the world.",
        "tech": "MongoDB, Express, React, Node"
      },
      {
        "title": "Eventifiy-your-map",
        "category": "A website to help locate events around you(Mvp)",
        "image": "eventify.png",
        "url": "https://frantzcfelix.github.io/Eventify-your-map/",
        "github": "https://github.com/FrantzCFelix/Eventify-your-map",
        "description": "This website finds events for the curious user. The user searchs for an event/artist like music festivals, comedy or a local musican. They are then presented a map with the locations of the events.",
        "tech": "Google Maps API, Ticketmaster API"
      },
      {
        "title": "Fitness Tracker",
        "category": "A workout tracking application!(Mvp)",
        "image": "fitness.png",
        "url": "https://fitness-tracker-mongod.herokuapp.com/",
        "github": "https://github.com/FrantzCFelix/fitness-tracker",
        "description": "As a user, I want to be able to view create and track daily workouts. I want to be able to log multiple exercises in a workout on a given day. I should also be able to track the name, type, weight, sets, reps, and duration of exercise. If the exercise is a cardio exercise, I should be able to track my distance traveled.",
        "tech": "Node.js, Express, mongoosedb, mongoose"
      }
    ]
  },
  "testimonials": {
    "testimonials": []
  }
}